Revit 2027 API
CircleLightShape Properties
The CircleLightShape type exposes the following members.
Properties
Name | Description
EmitDiameter |  The emit diameter.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from LightShape)
Top
See Also
Reference
CircleLightShape Class
Autodesk.Revit.DB.Lighting Namespace